99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_action/esp32_mquickjs_wifi_action.c
JSValue esp32_mquickjs_wifi_action_status(JSContext *ctx)
{
    esp32_mquickjs_wifi_action_lane_t native;
    esp32_mquickjs_wifi_radio_action_snapshot(&native);
    esp32_mquickjs_wifi_roc_status_t roc_status = {0};
    (void)esp32_mquickjs_wifi_roc_current_status(&roc_status);
    uint32_t roc_handles;
    bool roc_active, roc_cleanup;
    esp32_mquickjs_wifi_roc_counts(&roc_handles, &roc_active, &roc_cleanup);
    portENTER_CRITICAL(&s_action_retired_lock);
    bool pending = s_action_retired.active;
    esp_err_t error = s_action_retired.error;
    const char *stage = s_action_retired.stage;
    portEXIT_CRITICAL(&s_action_retired_lock);
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "operationActive", JS_NewBool(native.identity != 0U));
    SET(result, "kind", native.identity ? JS_NewString(ctx, native.kind == ESP32_MQUICKJS_WIFI_ACTION_ROC ? "roc" : "send") : JS_NULL);
    SET(result, "rocHandles", JS_NewUint32(ctx, roc_handles));
    SET(result, "rocActive", JS_NewBool(roc_active));
    SET(result, "rocError", roc_status.error ? JS_NewInt32(ctx, roc_status.error) : JS_NULL);
    SET(result, "rocStage", roc_status.stage ? JS_NewString(ctx, roc_status.stage) : JS_NULL);
    SET(result, "rocCleanupError", roc_status.cleanup_error ? JS_NewInt32(ctx, roc_status.cleanup_error) : JS_NULL);
    SET(result, "rocCleanupStage", roc_status.cleanup_stage ? JS_NewString(ctx, roc_status.cleanup_stage) : JS_NULL);
    SET(result, "sequence", native.identity ? JS_NewUint32(ctx, native.identity) : JS_NULL);
    SET(result, "radioGeneration", native.identity ? JS_NewUint32(ctx, native.generation) : JS_NULL);
    SET(result, "operationId", native.submitted ? JS_NewUint32(ctx, native.operation_id) : JS_NULL);
    SET(result, "terminal", JS_NewBool(native.terminal));
    SET(result, "ambiguous", JS_NewBool(native.ambiguous));
    SET(result, "nativeQuiescent", JS_NewBool(native.sdk_quiescent));
    SET(result, "nativeTerminated", JS_NewBool(native.physical_termination));
    SET(result, "identityExhausted", JS_NewBool(native.next_identity == 0U));
    SET(result, "cancelWritten", JS_NewBool(native.cancel_written));
    SET(result, "sdkFenced", JS_NewBool(native.sdk_fenced));
    SET(result, "eventFenced", JS_NewBool(native.event_fenced));
    SET(result, "cleanupPending", JS_NewBool(pending || roc_cleanup));
    SET(result, "cleanupError", error ? JS_NewInt32(ctx, error) : JS_NULL);
    SET(result, "cleanupStage", stage ? JS_NewString(ctx, stage) : JS_NULL);
    SET(result, "submitError", native.submit_error ? JS_NewInt32(ctx, native.submit_error) : JS_NULL);
    SET(result, "cancelError", native.cancel_error ? JS_NewInt32(ctx, native.cancel_error) : JS_NULL);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}
JSValue js_wifi_action_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.action.status expects no arguments");
    return esp32_mquickjs_wifi_action_status(ctx);
}
JSValue js_wifi_action_capabilities(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argv;
    if (argc != 0) return JS_ThrowTypeError(ctx, "wifi.action.capabilities expects no arguments");
    JSGCRef ref;
    JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result)) goto fail;
    SET(result, "apiVersion", JS_NewString(ctx, "wifi-action/1"));
    SET(result, "stability", JS_NewString(ctx, "candidate"));
    SET(result, "target", JS_NewString(ctx, CONFIG_IDF_TARGET));
#if CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    SET(result, "accessPoint", JS_TRUE);
#else
    SET(result, "accessPoint", JS_FALSE);
#endif
    SET(result, "maximumPayloadBytes", JS_NewInt32(ctx, 1476));
    SET(result, "maximumOperations", JS_NewInt32(ctx, 1));
    SET(result, "maximumRocHandles", JS_NewInt32(ctx, ESP32_MQUICKJS_WIFI_ROC_MAX_HANDLES));
    SET(result, "remainOnChannel", JS_TRUE);
    SET(result, "recover", JS_TRUE);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

JSValue js_wifi_action_send(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    JSGCRef global_ref, wifi_ref, module_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *wifi = JS_PushGCRef(ctx, &wifi_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *global = JS_GetGlobalObject(ctx);
    *wifi = JS_IsException(*global) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global, "wifi");
    *module = JS_IsException(*wifi) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *wifi, "action");
    *method = JS_IsException(*module) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *module, "send");
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *module, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &wifi_ref); JS_PopGCRef(ctx, &global_ref);
    return result;
}

bool esp32_mquickjs_init_wifi_action_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, wifi_ref, module_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref), *wifi = JS_PushGCRef(ctx, &wifi_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref), *method = JS_PushGCRef(ctx, &method_ref);
    *global = JS_GetGlobalObject(ctx);
    *wifi = JS_IsException(*global) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *global, "wifi");
    *module = JS_IsException(*wifi) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *wifi, "action");
    *method = JS_IsException(*module) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *module, "send");
    bool ok = !JS_IsException(*method) && esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_action_driver) &&
        esp32_mquickjs_register_async_poller(runtime, action_service, NULL) &&
        esp32_mquickjs_init_wifi_roc_runtime(ctx, runtime) &&
        esp32_mquickjs_init_wifi_action_recovery_runtime(ctx, runtime);
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register Action runtime");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &wifi_ref); JS_PopGCRef(ctx, &global_ref);
    return ok;
}
#endif
